app/controllers/application_controller.rb

    def current_user
      if session[:gardener_id].present?
        gardener = Gardener.find_by(:id => session[:gardener_id])
---
SELECT "gardeners".* FROM "gardeners" WHERE "gardeners"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]