app/controllers/gardeners_controller.rb

INSERT INTO "gardeners" ("username", "password_digest", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @gardener = Gardener.new(gardener_params)

    if @gardener.save

SELECT "gardeners".* FROM "gardeners" WHERE "gardeners"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    if_not_logged_in_redirect
    @gardener = Gardener.find_by_id(params[:id])