app/controllers/sessions_controller.rb

  def create
    # login with Github
    # email from request.env["omniauth.auth"] is returning nil, using username instead
    if auth_hash = request.env["omniauth.auth"]
      @gardener = Gardener.find_or_create_by_omniauth(auth_hash)
      session[:gardener_id] = @gardener.id

      redirect_to gardener_path(@gardener)
    else
      # login with username/pw
      @gardener = Gardener.find_by(username: params[:username])
---
SELECT "gardeners".* FROM "gardeners" WHERE "gardeners"."username" = ? LIMIT ?  [["username", "k1"], ["LIMIT", 1]]